<template>
    <div class="Pregister">
        <p class="title">您好，请注册！</p>
        <group class="inputbox" gutter="0">
            <x-input class="xinput" placeholder="请输入用户名" v-model="username">
                <img slot="label" :src="require('@/assets/img/Pres/username.png')" alt="">
            </x-input>
        </group>
        <group class="inputbox" gutter="0">
            <x-input class="xinput" placeholder="请输入手机号码" v-model="phone">
                <img slot="label" :src="require('@/assets/img/Pres/phone.png')" alt="">
            </x-input>
        </group>
        <group class="inputbox" gutter="0">
            <x-input class="xinput" placeholder="请输入验证码" v-model="yzm">
                <img slot="label" :src="require('@/assets/img/Pres/message.png')" alt="">
                
            </x-input>
            <div class="getyz">| <span @click="getyz">获取验证码</span></div>
        </group>
        <group class="inputbox" gutter="0">
            <x-input class="xinput" type="password" placeholder="请输入密码" v-model="psdnum">
                <img slot="label" :src="require('@/assets/img/Pres/lock.png')" alt="">
            </x-input>
        </group>
        <group class="inputbox" gutter="0">
            <x-input class="xinput" placeholder="请输入邀请码" v-model="yqm">
                <img slot="label" :src="require('@/assets/img/Pres/link.png')" alt="">
            </x-input>
        </group>
        <group class="inputbox" gutter="0">
            <label>
                <img v-if="fuyinshow" :src="require('@/assets/img/Pres/checked.png')" alt="">
                <img v-else :src="require('@/assets/img/Pres/uchecked.png')" alt="">
                <input ref="fuyin" @click="fuyin" type="checkbox">
                <span class="sureread">我已阅读并且同意 <a href="javascript:;" @click.prevent="makefuyinshowfz">《服务与隐私协议》</a></span>
            </label>
        </group>
        <group class="inputbox" gutter="0">
            <label>
                <img v-if="fushow" :src="require('@/assets/img/Pres/checked.png')" alt="">
                <img v-else :src="require('@/assets/img/Pres/uchecked.png')" alt="">
                <input ref="fu" @click="fu" type="checkbox">
                <span class="sureread">我已阅读并且同意 <a href="javascript:;" @click.prevent="makefushowfz">《服务协议》</a></span>
            </label>
        </group>
        <div class="titlelist">
            <span class="smltitle" @click.prevent="gologin">前往登陆</span>
        </div>
        <div class="submit" @click="checksub">确认提交</div>
        <!-- <div @click="kk">asdfsdfdf</div> -->
        <x-dialog class="xdfuyin" v-model="makefuyinshow" :hide-on-blur="true">
            <div class="xdcontainer">
                <div class="xdcontent">
                    <p class="title">尚吉通信服务与隐私协议</p>
                    <p>尚吉通信尚吉通信服务与隐私协议（以下简称本协议）由您与宁波尚吉通信科技有限公司（以下简称本公司）签订。您确认，在申请本协议项下服务时，已详细阅读本协议的所有内容，您充分理解并同意接受本协议的全部内容。本协议会对与您的权益具有或可能具有重大关系的条款，以及对本公司具有或可能具有免责或限制责任的条款均用粗体字标注，请您注意。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作。</p>
                    <p class="subtitle">一、声明与承诺</p>
                    <p>（一）尚吉通信服务系统是由本公司运营并所有的为尚吉通信个人用户提供的信用评估、快速提现、账单还款等服务的服务系统。为了保障您的权益，您应保证自己在注册使用尚吉通信时为具有完全民事行为能力的自然人。您在自愿注册使用本尚吉通信服务前，必须仔细阅读本服务协议所有条款。一经注册使用尚吉通信即视为您对本协议服务条款的接受和确认。
（二）您同意，本公司可对本协议内容进行单方变更或修改，并以公告的方式予以公布，不另作个别通知，您可以通过尚吉通信客户端／公司网站等途径查阅；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应停止使用本服务。
（三）您同意，您在尚吉通信公司网站或尚吉通信客户端上发生的所有行为，您不可撤销的授权由本公司按照《尚吉通信服务与隐私协议》进行处理；同时本公司有权为提供前述服务的需要获取您的相关信息（包括但不限于个人信息、行为信息、账户相关信息等）。本公司按照您的操作指令或《尚吉通信服务与隐私协议》的相关约定进行资金的冻结、扣划完全来自于您的授权，因此造成的任何损失本公司不承担任何责任。但您确认，您使用尚吉通信服务时，您仍应完全遵守本《尚吉通信服务与隐私协议》及本公司制定的各项规则及页面提示等。</p>
                    <p class="subtitle">二、尚吉通信账户</p>
                    <p>（一）注册相关
除本协议另有规定或相关产品另有规则外，您须在本无线客户端注册并取得本公司提供给您的尚吉通信账户。您同意：
1、本公司仅向符合中华人民共和国法律规定的具有完全民事权利能力和民事行为能力，能够独立承担民事责任的中国大陆地区的自然人提供尚吉通信服务。
2、您必须依尚吉通信服务注册表的要求提供您本人准确、真实、有效、最新及完整的资料（包括但不限于身份证、户口本、护照等证件或其他身份证明文件、联系方式、与尚吉通信账户（或称“账户”））及与之关联的银行账户、绑定的电子邮箱、手机号码等，如有变更，应及时通知本公司并按照本公司要求办理变更手续。
3、您有义务维持您的“用户资料”，确保其准确、真实、有效及完整。若您提供任何错误、虚假、失效或不完整的资料，或者本公司有合理的理由怀疑资料为错误、虚假、过期或不完整的，本公司有权暂停或终止向您提供部分或全部尚吉通信服务，对此本公司不承担任何责任，您承诺并同意负担因此所产生的所有损失，包括但不限于直接损失、间接损失。若因国家法律法规、部门规章或监管机构的要求，本公司需要您补充提供任何相关资料时，如您不能及时配合提供，本公司有权暂停或终止向您提供部分或全部尚吉通信服务。
4、为了适用法律规范，本条款及任何其他的协议、告示或其他关于您使用本服务账户及服务的通知，您同意本公司通过电子方式通知您。电子方式包括但不限于以电子邮件方式、或于本网站或者合作网站上公布、或无线通讯装置通知等方式。上述条款、协议、通知、告示一经发出，即视为已送达。 5、您确认，只有您本人可以使用您的尚吉通信账户。
（二）账户安全
您了解并同意 , 确保密码及账号的机密安全是您的责任。您将对使用该账户或密码进行的一切操作及言论负完全的责任，您同意：
1、您不可对其他任何人泄露您的账户或密码，亦不可使用其他任何人的账户或密码。您应当对该等密码、身份信息等进行妥善保管，对于因密码、身份信息、校验码等泄露所致的损失由您自行承担。
2、您同意，如您发现有他人冒用或盗用您的尚吉通信登录名及密码或任何其他未经合法授权之情形，或发生与尚吉通信账户关联的手机或其他设备遗失或其他可能危及到尚吉通信账户资金安全情形时，应立即以有效方式通知本公司，向本公司申请暂停相关服务。并且同意本公司可暂停您使用本服务并采取有效的防范措施。本公司在接受您的有效通知前，对第三人使用该服务已发生之效力，除非可证明本公司故意或重大过失而且是未经合法授权之使用，否则本公司将不承担任何责任。
3、除非另有法律规定或经司法裁判，且征得本公司同意，否则您的尚吉通信登录名及密码、尚吉通信账户不得以任何方式转让、赠与或继承（相关的财产权益除外）。在您决定不再使用该账户时，您应将该账户下所对应的可用款项全部提现或者向尚吉通信发出其它支付指令。您同意，若您丧失全部或部分民事权利能力或民事行为能力，本公司有权根据有效法律文书（包括但不限于生效的法院判决、生效的遗嘱等）处置与您的尚吉通信账户相关的款项。
4、交易异常处理：您使用本服务时同意并认可，可能由于银行本身系统问题、银行相关作业网络连线问题或其他不可抗拒因素，造成本服务无法提供。您确保所输入的您的资料无误，如果因资料错误造成本公司于上述异常状况发生时无法及时通知您相关交易后续处理方式的，本公司不承担任何损害赔偿责任。
5、本公司有权了解您使用尚吉通信的真实交易背景及目的，您应如实提供本公司所需的真实、全面、准确的信息；如果本公司有合理理由怀疑您提供虚假交易信息的，本公司有权暂时或永久限制您所使用的服务的部分或全部功能。
6.为了您尚吉通信账户及其内资金的安全，根据本协议的约定、法律法规及法律文书的规定、政府依行政职权的要求及本公司依据自行判断认为的可能对您的尚吉通信账户产生风险的情况，您同意本公司有权对您的尚吉通信账户进行冻结，即进行暂时关闭该账户部分或全部使用权限的操作。冻结的逆过程为解冻，即本公司对您的被冻结的尚吉通信账户结束冻结。当冻结发生时，如您申请解冻，本公司有权依照自行判断根据本项规定前述的冻结原因来决定是否允许解冻，您应充分理解您的解冻申请并不必然被允许，且申请解冻时您应当配合本公司核实您的身份的有关要求，提供包括但不限于身份信息、身份证、护照、其他有效的身份证明文件及本公司要求的其他信息或文件。
7. 您同意，本公司有权按照包括但不限于公安机关、检察机关、法院、海关、税务机关等司法机关、行政机关、军事机关的要求或基于本公司对您资金及交易异常的判断及风险策略对您在尚吉通信的资金及账户等进行查询、冻结或扣划。
（三）注销相关
在需要终止使用本服务时，您可以申请注销您的尚吉通信账户，您同意：
1、您所申请注销的尚吉通信账户应当是您本人的账户。您应当依照本公司规定的程序进行尚吉通信账户注销。
2、尚吉通信账户注销将导致本公司终止为您提供本服务，本协议约定的双方的权利义务终止，但依本协议其他条款另行约定不得终止的或依其性质不能终止的如保密协议及保密条款等除外。
3、您申请注销的尚吉通信账户应当不存在任何由于该账户被注销而导致的未了结的合同关系与其他基于该账户的存在而产生或维持的权利义务，及本公司认为注销该账户会由此产生未了结的权利义务而产生纠纷的情况。我公司始终保留对您的债权及债权规则条款的效力，不因注销尚吉通信账户而放弃。</p>
                    <p class="subtitle">三、尚吉通信服务</p>
                    <p>（一）尚吉通信服务（以下简称为本服务）：指本条（四）所列的信用评估、借款、代收、代付等服务，及您实际使用的本公司或本公司接受您的委托为您不时提供的服务以及提供的其他服务。
（二）在使用信用评估服务前，您需符合下列要求：
1、您使用尚吉通信信用评估服务符合当地的法律法规，并能独立承担法律责任。
2、您需提供真实、有效、完整和最新的注册信息。
（三）在使用提现、代收或代付服务前，您需符合下列要求：
1、您使用尚吉通信提现、支付或还款服务符合当地的法律法规，并能独立承担法律责任。
2、您已开设了有效的银行账户，并将其与尚吉通信银行卡服务绑定（在您同意接受本协议时，您所提供的银行卡账户为您本人名下账户）。
3、您需提供真实、有效、完整和最新的注册信息，且通过了信用评估或相关信息认证。
（四）尚吉通信服务包括但不限于：信用评估、借款、代收、代付等，具体详情以本公司当时提供的服务内容为准。
1、信用评估服务：信用评估即授予信用额度，信用评估服务是指本公司为您提供的通过读取和分析您的个人公开信息、您所授权的微博等账号信息及其他授权信息来形成您的个人信用码，授予您信用额度的服务。
2、借款／代付服务：在符合本公司规定或产品规则的情况下，您可以请求本公司在您尚吉通信账户中的信用额度范围内提供投资人撮合服务，并提取到您名下的有效中国大陆银行账户内或支付到本公司合作商家的银行账户内，以满足您的资金需求。代收服务：如您在尚吉通信上使用了提现/代付服务，依据《借款与还款协议》本公司将在账单到期后，通过您所绑定的银行账户为您提供代收还款服务。
3、在您使用尚吉通信服务期间，本公司不对代收或代付的款项的货币贬值承担任何风险，并且本公司无须向您支付此等款项的任何孳息。
4、您同意基于运行的需要 , 本公司可以暂时提供部分服务功能 , 或于将来暂停部分服务功能或开通新的服务功能、对系统进行升级及改造 , 因此可能导致对您提供的尚吉通信服务延迟或限制或终止的，不视为本公司的违约。当任何功能减少或者增加或者变化时 , 只要您仍然使用尚吉通信服务 , 表示您仍然同意本条款或者本条款修正后的条款。
（五）授权条款：
您完全理解并不可撤销地授予本公司及其关联公司下列权利：
1、对于您提供的资料、数据信息，及本协议第一条中描述信息，您授予本公司及其关联公司独家的、全球通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)。此外，本公司及其关联公司有权(全部或部分地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示您的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于尚吉通信的各类信息）。
2、本公司关联公司将逐渐允许尚吉通信用户登录关联公司平台并使用其服务，尚吉通信用户在关联公司平台的任何行为均需遵守该等平台服务协议的约定、平台公布的规则以及有关正确使用平台服务的说明和操作指引。为了实现上述功能，您同意本公司将您在尚吉通信的注册信息、交易/支付数据等信息和其他数据同步至关联公司系统并允许其使用。
3、您理解并同意，您注册使用尚吉通信时，即授权本公司根据您所提供的各项信息及本公司独立获得的信息评定您在本公司所拥有的个人信用额度，或决定是否审核通过您的服务申请。
4、您理解并同意，授权我公司使用您注册尚吉通信账户或使用尚吉通信提供的各项服务时，您提供的个人信息，例如姓名、身份证明、地址、电话号码和常用电子邮件地址、生物特征等信息及相关附加信息（如您所在的省份和城市、邮政编码等）。
5、您理解并同意，授权我公司获得并使用您向本公司提供信用卡账单邮箱数据。
6、您理解并同意，授权我公司使用您的学信网账户。如您已注册学信网的，本公司将可能通过您的学信网账户查看并读取您的学籍信息；如您在授权时尚未注册学信网账户，本公司将基于您的授权代您申请注册学信网账户。
7、您理解并同意，如您向本公司提交、绑定或授权您的银行卡信息／账户，本公司将可能:
1）查询并核对您的账户信息。
2）查询并读取您银行卡账户中的交易信息。
3）基于《借款与还款协议》通过您所授权或绑定的银行卡账户进行代收与代付服务。
8、您理解并同意，如您向本公司授权您的新浪微博、腾讯微博、人人网信息、淘宝等账户，本公司将可能读取您所授权的账号中的相关信息。
9、您理解并同意，在您注册或使用尚吉通信时，本公司将可能依据《征信业管理条例》及相关法律法规，向第三方支付/征信/金融机构合法了解、获取、核实您的信用信息。所获取的个人信用信息仅在尚吉通信业务中使用，且不向其他机构、个人提供或披露。
10、您理解并同意，如您使用了提现或支付功能，则应当依据《借款与还款协议》中约定之日期按期进行还款，本公司有权通过短信、电话、社交账号等途径对您进行服务与还款提醒。您理解并同意，如您未有按期履行还款义务，您的个人逾期信息将可能向第三方进行分享或公布。
11、您理解并同意，为了便于您与您的好友进行更加灵活、安全的资金往来，避免因手动输入尚吉通信登录名错误而产生损失，您将授权我公司获取您的通讯录信息；当您的尚吉通信账户所关联的手机号码被保存在他人手机通讯录中时，您的尚吉通信登录名、姓名等可以被通讯录存有该手机号码的好友查询到。
12、您理解并同意，在注册过程中选择的银行或第三方合作机构基于更好的为您提供服务有权获得您的相关信息。
13、您理解并同意，我们可以储存您授权的原始信息；在您和我们的合作存续期间，我们随时可以从新采集和更新数据，对于经过加工和脱敏处理的数据，我们可以永久保存在服务器上；对于原始数据，在合作结束后，我们保留最长不超过90天。</p>
                    <p class="subtitle">四、尚吉通信服务使用规则</p>
                    <p>为有效保障您使用本服务时的合法权益，您理解并同意接受以下规则：
（一）本公司通过您的尚吉通信账户接受来自您的指令，无论您通过何种方式向本公司发出指令，都不可撤回或撤销，且视为您本人的指令。
（二）您应按照本公司的要求完善您的身份信息以最终达到实名，否则您可能会受到信用评估、借款、支付和（或）还款的限制，且本公司有权对您的账户进行冻结，直至您达到实名。请您保证您信息的真实性，若被检测出虚假信息，系统将会采取拒绝决议，若涉嫌恶意信息作假或盗用他人信息，将可能记入网络征信系统，影响您的征信记录，同时本公司将保留追究您相应法律责任的权利。
1、本公司有权采取各种必要手段（包括但不限于向第三方确认）对您的身份进行识别。由于目前的技术水平下本公司所能采取的方法有限，且在网络上进行用户身份识别存在一定的困难，因此，本公司对完成实名认证的用户身份的准确性和绝对真实性不做任何保证。
2、您同意，本公司有权记录并保存您在实名认证中提供给本公司的身份信息和本公司向其他合作方获取的身份信息，亦有权根据本协议的约定向您或第三方提供您是否通过实名认证以及您的实名认证身份信息。
3、上述身份信息包括但不限于您的尚吉通信账户( 或称“账户”)及与之关联的银行账户、密码、数字证书、短信校验服务、签约时设置的电话号码、手机号码、身份证件名称、证件号码、证件有效期限、联系地址、电子邮箱等及本公司认可的或法律法规规定的其他信息要素。
4、您同意，您有义务按照本公司的要求提供本人的真实身份信息进行注册及实名认证，并保证上述身份信息的准确性、真实性、有效性、完整性，同时也有义务在相关资料发生变更时及时通知本公司进行更新。若因您提供任何错误、不实、无效或不完整信息，或本公司有合理理由怀疑该资料为错误、不实、过时或不完整的，本公司有权暂停或终止对您提供服务，或限制您尚吉通信账户的部分或全部功能，本公司对此不承担任何责任。
5、除非本协议另有约定，一旦您的尚吉通信账户完成了实名认证，相关信息和实名认证结果将不能由您自行进行任何修改；如果您的身份信息等在完成实名认证后发生了变更，您应按本公司要求提供资料且由本公司审核后进行更新。
6、若您未满16周岁或未满足本协议规定的条件而以不当方式注册成为本公司用户或通过本公司实名认证的，则因此产生的一切法律责任应由您及(或)您的监护人承担；因此给本公司造成损失的，您及（或）您的监护人应向本公司进行赔偿。同时本公司有权随时停止为您提供服务。
7、身份实名认证信息共享。为了使您享有便捷的服务，您经由其它网站或其他合作方向本公司提交实名认证申请即表示您同意本公司为您核对所提交的全部身份信息和银行账户信息，并同意本公司将实名认证结果及相关身份信息提供给该网站或合作方。
8、实名认证身份信息的管理
您在实名认证时提交给本公司的实名认证身份信息，即不可撤销地授权由本公司保留。本公司承诺除法定或约定事由外，不公开或编辑或透露您的实名认证身份信息及保存在本公司的非公开内容，不将此类内容用于商业目的，但第四条规定以及以下情形除外：
（1）您授权本公司透露的相关信息；
（2）本公司按照法律法规的规定向国家有权机关提供；
（3）向本公司关联公司提供；
（4）第三方和本公司一起为您提供服务时，该第三方向您提供服务所需的相关信息；
9、不得为非法或禁止的使用。接受本协议全部的说明、条款、条件是您申请实名认证的先决条件。您声明并保证，您不得为任何非法或为本协议所禁止之目的进行实名认证申请。您不得以任何可能损害、使瘫痪、使过度负荷或损害其他网站或其他网站的服务或本公司或干扰他人对于尚吉通信实名认证申请的使用等方式使用实名认证服务。您不得经由非本公司许可提供的任何方式取得或试图取得任何资料或信息。
（三）本公司并非银行或其它金融机构，本服务也非金融业务，本协议项下的资金移转均通过银行或第三方支付公司来实现，你理解并同意您的资金于流转途中的合理时间。
（四）交易风险
因您的过错导致的任何损失由您自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏密码、校验码等，密码被他人破解。因非本公司原因造成的泄露密码、数字证书、绑定手机号、丢失借记卡或支付盾等所致损失需由您自行承担。
（五）服务费用
在您使用本服务时，本公司有权依照双方签订的电子交易合同向您收取服务费用。本公司拥有制订及调整服务费之权利，具体服务费用以您使用本服务时本网站或客户端、产品页面上所列之收费方式公告或您与本公司达成的其他书面协议为准。若您继续使用尚吉通信服务的，则视为接受尚吉通信的相关费用标准。您同意，除非另有说明，本公司有权自您委托本公司代管、代收或代付的款项中直接扣除上述服务费用。
（六）第三方网站的链接
为实现身份信息审查及业务合作，尚吉通信网站或无线客户端上可能包含了指向第三方网站（如网上银行网站）的链接（以下简称“链接网站”）。“链接网站”非由本公司控制，对于任何“链接网站”的内容，包含但不限于“链接网站”内含的任何链接，或“链接网站”的任何改变或更新，本公司均不予负责。自“链接网站”接收的网络传播或其它形式之传送，本公司不予负责。</p>
                    <p class="subtitle">五、尚吉通信服务使用限制</p>
                    <p>（一）您在使用本服务时应遵守中华人民共和国相关法律法规、您所在国家或地区之法令及相关国际惯例，不将本服务用于任何非法目的，也不以任何非法方式使用本服务，否则本公司有权拒绝提供本服务，或提前终止协议并追回借款，且您应承担所有相关法律责任。
（二）您不得利用本服务从事侵害他人合法权益之行为，否则本公司有权拒绝提供本服务，且您应承担所有相关法律责任，因此导致本公司或本公司雇员或其他方受损的，您应承担赔偿责任。上述行为包括但不限于:
1、反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的。
2、侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权、其他智慧财产等合法权益。
3、违反依法定或约定之保密义务。
4、冒用他人名义使用本服务。
5、从事不法交易如涉嫌洗钱、套现或进行传销活动等行为。
6、未按时履行还款义务。
7、提供骗贷资讯或以任何方式引诱他人参与骗贷。
8、非法使用他人银行账户或无效银行账户交易。
9、从事任何可能含有电脑病毒或是可能侵害本服务系统、资料之行为。
10、其他本公司有正当理由认为不适当之行为。
（三）您理解并同意，本公司不对因下述任一情况导致的任何损害赔偿承担责任:
1、本公司有权基于单方判断，包含但不限于本公司认为您已经违反本协议的明文规定及精神，对您的名下的全部或部分尚吉通信账户暂停、中断或终止向您提供本服务或其任何部分，并移除或公布您的资料。
2、本公司在发现异常交易或合理怀疑交易有疑义或有违反法律规定或本协议约定之虞时，有权不经通知先行暂停或终止您尚吉通信账户的使用（包括但不限于对账户名下的信用额度和在途交易采取取消交易、调账等限制措施），并拒绝您使用本服务之部分或全部功能。
3、您理解并同意，存在如下情形时，本公司有权对您名下尚吉通信账户或交易的进行冻结或追回，且有权限制您所使用的产品或服务的部分或全部功能：
1）根据本协议的约定；
2）根据法律法规及法律文书的规定；
3）根据有权机关的要求；
4）您使用尚吉通信服务的行为涉嫌违反国家法律法规及行政规定的；
5）本公司基于单方面合理判断认为账户信息、操作等存在异常时；
6）本公司依据自行合理判断认为可能产生风险的；
7）您在参加市场活动时有批量注册账户、提供虚假信息或材料及其他舞弊等违反活动规则、违反诚实信用原则的；
8）错误汇入资金等导致您可能存在不当得利的；
9）您未按时履行还款义务的；
10）您遭到他人投诉，且对方已经提供了一定证据的。
4、如您申请解除上述冻结或限制，您应按本公司要求如实提供相关资料及您的身份证明以及本公司要求的其他信息或文件，以便本公司进行核实，且本公司有权依照自行判断来决定是否同意您的申请。</p>
                    <p class="subtitle">六、隐私权保护</p>
                    <p>本公司重视对用户隐私的保护。因收集您的信息是出于遵守国家法律法规的规定以及向您提供服务及提升服务质量的目的，本公司对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息，本公司会在下列情况下才将您的信息与第三方共享：
1、获得您的同意或授权。
2、为了向您提供或推荐服务、产品，或为了向您提供更完善的服务，或者为了让您拥有更广泛的社交体验，我们会与包括尚吉通信关联公司、旗下公司及合作商户在内的第三方共享您的相关信息。
3、某些情况下，只有共享您的信息，才能提供您需要的服务和（或）产品，或处理您与他人的交易纠纷或争议。
4、为了判断您的尚吉通信账户或交易是否安全。
5、某些服务和（或）产品由我们的合作伙伴提供或由我们与合作伙伴、供应商共同提供，我们会与其共享提供服务和（或）产品需要的信息。
6、我们与第三方进行联合推广活动，我们可能与其共享活动过程中产生的、为完成活动所必要的个人信息。
7、为维护尚吉通信及尚吉通信关联公司、旗下公司和其他尚吉通信用户的合法权益。
8、根据法律规定及合理商业习惯，在我们计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行）时，以及其他情形下我们需要接受来自其他主体的尽职调查时，我们会把您的信息提供给必要的主体，但我们会通过和这些主体签署保密协议等方式要求其对您的个人信息采取合理的保密措施。
9、为了便于您与您的好友进行更加灵活、安全的资金往来，避免因手动输入尚吉通信登录名错误而产生损失，当您的尚吉通信账户所关联的手机号码被保存在他人手机通讯录中时，您的尚吉通信登录名、姓名等可以被通讯录存有该手机号码的好友查询到。本协议中所称的“尚吉通信账户关联的手机号码”，是指作为尚吉通信登录名的手机号码或尚吉通信账户绑定的手机号码。
10、同本部分第9项之目的，他人可以通过您尚吉通信账户关联手机号码查询到对应的尚吉通信登录名、您的姓名。
11、您与他人通过尚吉通信服务发生资金往来的，交易相对方可在付款过程中，或付款成功后可查看到您使用的尚吉通信账户的部分信息（包括尚吉通信登录名、尚吉通信账户对应的姓名或昵称、尚吉通信账户头像等，具体以实际可查看信息为准）。
12、如您授权第三方向尚吉通信查询、采集您尚吉通信账户相关信息，我们有权在法律法规和您的授权许可范围内向第三方分享您尚吉通信账户的部分信息。
13、为了维护和改善我们的服务。
14、根据法律法规的规定或有权机关的要求。</p>
                    <p class="subtitle">七、系统中断或故障</p>
                    <p>本公司公告系统停机维护期间，信息网络连接故障，电脑、通讯或其他系统故障，系统因维修、故障、黑客攻击、电信部门技术调整或故障、网站升级、银行方面、政府或司法行为、意外、不可抗力等状况无法正常运作，使您无法使用或延迟使用各项服务时，本公司不承担损害赔偿责任。</p>
                    <p class="subtitle">八、责任范围及责任限制</p>
                    <p>（一）本公司仅对本协议中所列明的义务承担责任。
（二）本公司负责按"现状"和"可得到"的状态向您提供尚吉通信服务。但本公司对尚吉通信服务不作任何明示或暗示的保证，包括但不限于尚吉通信服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，本公司也不对尚吉通信服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性做出任何承诺和保证。
（三）您明确因交易所产生的任何风险应由交易双方承担。
（四）分期平台卖方信息是由卖方自行发布，本公司无法保证卖方信息的真实、及时和完整，您应对您的判断承担全部责任。
（五）本公司未对交易标的及“尚吉通信”服务提供任何形式的保证，包括但不限于以下事项：
1.“尚吉通信”服务将符合您的需求。
2.“尚吉通信”服务将不受干扰、及时提供或免于出錯。
3. 您经由“尚吉通信”服务购买或取得之任何产品、服务、资讯或其他资料将符合您的期望。
（六）除非法律法规明确要求，或出现以下情况，否则，本公司没有义务对所有用户的注册数据、商品（服务）信息、交易行为以及与交易有关的其它事项进行事先审查：
1.本公司有合理的理由认为具体交易事项可能存在重大违法或违约情形。
2.本公司有合理的理由认为用户在尚吉通信的行为涉嫌违法或不当。
（七）本公司或本公司授权的第三方或您与本公司一致同意的第三方有权基于您不可撤销的授权受理您与其他用户因交易产生的争议，并有权单方判断与该争议相关的事实及应适用的规则，进而做出处理决定，包括但不限于调整相关交易状态，或本公司将争议货款的全部或部分支付给交易一方或双方。该处理决定对您有约束力。如您未在限期内执行处理决定的，则本公司有权利（但无义务）直接使用您尚吉通信账户内的款项，或使用您向本公司及其关联公司交纳的保证金代为支付。您应及时补足保证金并弥补本公司及其关联公司的损失，否则本公司及其关联公司有权直接抵减您在其它合同项下的权益，并有权继续追偿。
您理解并同意，本公司或本公司授权的第三方或您与本公司一致同意的第三方并非司法机构，仅能以普通人的身份对证据进行鉴别，本公司或本公司授权的第三方或您与本公司一致同意的第三方对争议的调处完全是基于您不可撤销的授权，其无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行向受益人索偿。
（八）您了解并同意，本公司不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论本公司是否已被告知该等损害赔偿的可能性) ：
1. 使用或未能使用本公司平台服务。
2. 第三方未经批准的使用您的账户或更改您的数据。
3.通过本公司平台服务购买或获取任何商品、样品、数据、信息或进行交易等行为或替代行为产生的费用及损失。
4. 您对本公司平台服务的误解。
5. 任何非因本公司的原因而引起的与本公司平台服务有关的其它损失。
（九）免责
您同意，在下列情形下本公司无需承担任何责任：
1.由于您将尚吉通信账户密码告知他人或未保管好自己的密码或与他人共享尚吉通信账户或任何其他非本公司的过错，导致您的个人资料泄露。
2.任何由于黑客攻击、计算机病毒侵入或发作、电信部门技术调整导致之影响、因政府管制而造成的暂时性关闭、由于第三方原因(包括不可抗力，例如国际出口的主干线路及国际出口电信提供商一方出现故障、火灾、水灾、雷击、地震、洪水、台风、龙卷风、火山爆发、瘟疫和传染病流行、罢工、战争或暴力行为或类似事件等)及其他非因本公司过错而造成的实名认证信息泄露、丢失、被盗用或被篡改等。
3.由于与本公司链接或合作的其它网站（如网上银行等）所造成的银行账户信息、身份信息泄露及由此而导致的任何法律争议和后果。
4.任何尚吉通信用户（包括未成年人用户）向本公司提供错误、不完整、不实信息等造成不能通过实名认证或遭受任何其他损失，概与本公司无关。
（十） “尚吉通信”服务的合作单位，所提供的服务品质及内容由该合作单位自行负责。
（十一） 您经由“尚吉通信”服务的使用下载或取得任何资料，应由您自行考量且自负风险，因资料的下载而导致您电脑系统的任何损坏或资料流失，您应负完全责任。
（十二） 您自本公司及公司工作人员或经由“尚吉通信”服务取得的建议或资讯，无论其为书面或口头，均不构成本公司对“尚吉通信”服务的任何保证。
（十三）在法律允许的情况下，本公司对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使其事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除本公司对上述损失的责任。
（十四）除本协议另有规定外，在任何情况下，本公司对本协议所承担的违约赔偿责任总额不超过向您收取的当次“尚吉通信”服务费用总额。
（十五）本公司仅对本协议中列明的责任承担范围负责。
（十六）本公司用户信息是由用户本人自行提供的，本公司无法保证该信息之准确、及时和完整。
（十七）本公司不对信用评估额度及本服务提供任何形式的保证。</p>
                    <p class="subtitle">九、完整协议</p>
                    <p>本协议由本协议条款与《保密与授权协议》、《征信授权协议》、《信用卡账单授权协议》、《学信网信息授权协议》、《尚吉通信银行卡用户服务协议》、《信用卡账单授权协议》、《淘宝网信息授权协议》、《新浪微博信息授权协议》、《腾讯微博信息授权协议》、《人人网信息授权协议》、《借款与还款协议》、《尚吉通信活动规则》等本公司公示的各项规则组成，相关名词可互相引用参照，如有不同理解，以本协议条款为准。您对本协议理解和认同，您即对本协议所有组成部分的内容理解并认同，一旦您使用本服务，您和本公司即受本协议所有组成部分的约束。</p>
                    <p class="subtitle">十、商标、知识产权、专利的保护</p>
                    <p>（一）本公司及关联公司所有系统及本公司上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由本公司或本公司关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
（二）非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。
（三）尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。</p>
                    <p class="subtitle">十一、法律适用与管辖</p>
                    <p>本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由北京市朝阳区人民法院管辖。</p>
                    <p class="subtitle">十二、附属协议：《征信授权协议》</p>
                    <p class="title">征信授权协议</p>
                    <p>征信授权协议（以下简称本协议）由您与宁波尚吉通信科技有限公司（以下简称本公司）签订。如您点击选择同意此协议将视为授权本公司向第三方支付／征信／金融机构查询／提交您的信用信息，并将视为已阅读并理解本协议的全部内容。本协议会对与您的权益具有或可能具有重大关系的条款，以及对本公司具有或可能具有免责或限制责任的条款均用粗体字标注，请您注意。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作。本协议作为《服务与隐私协议》及《保密与授权协议》的补充协议，在其基础上作补充授权。</p>
                    <p class="subtitle">一、授权条款</p>
                    <p>（一）您理解并同意，在您注册或使用尚吉通信时，本公司将可能依据《征信业管理条例》及相关法律法规，向第三方支付/征信/金融机构合法了解、获取、核实您的信用信息。
（二）您理解并同意，在您注册或使用尚吉通信时，本公司将可能依据《征信业管理条例》及相关法律法规，向第三方支付/征信/金融机构提交您在本公司业务中产生的相关信息，包括个人基本信息、信用／提现信息、借款申请信息、借款合同信息以及还款行为信息等，并记录在上述机构建设的个人信用信息数据库中。
（三）您理解并同意，如您使用了提现或支付功能，则应当依据《借款与还款协议》中约定之日期按期进行还款，本公司将通过短信、电话、社交账号等途径对您进行服务与还款提醒。您理解并同意，如您未有按期还款，您的个人逾期信息将可能向第三方进行分享或公布，记录在您的个人信用信息数据库中。请您珍视自身的信用记录，按时履行还款义务。
（四）您理解并同意，您应当对您的信息变动履行及时告知义务。若您的联系方式发生变化，应及时通知本公司，否则由此带来的影响和损失，本公司不承担责任。
（五）与本公司合作的第三方征信机构包括：北京安融惠众征信有限公司。</p>
                    <p class="subtitle">二、保密条款</p>
                    <p>（一）本平台重视对用户隐私的保护。因收集您的信息是出于遵守国家法律法规的规定以及向您提供服务及提升服务质量的目的，本公司对您的信用信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息。
（二）本公司会在下列情况下才将您的个人信用信息与第三方共享：
1、获得您的同意或授权。
2、为了向您提供或推荐服务、产品，或为了向您提供更完善的服务，或者为了让您拥有更广泛的社交体验，我们会与包括尚吉通信关联公司、旗下公司及合作商户在内的第三方共享您的相关信息。
3、某些情况下，只有共享您的信息，才能提供您需要的服务和（或）产品，或处理您与他人的交易纠纷或争议。
4、为了判断您的尚吉通信账户或交易是否安全。
5、某些服务和（或）产品由我们的合作伙伴提供或由我们与合作伙伴、供应商共同提供，我们会与其共享提供服务和（或）产品需要的信息。
6、我们与第三方进行联合推广活动，我们可能与其共享活动过程中产生的、为完成活动所必要的个人信息。
7、为维护尚吉通信及尚吉通信关联公司、旗下公司和其他尚吉通信用户的合法权益。
8、根据法律规定及合理商业习惯，在我们计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行）时，以及其他情形下我们需要接受来自其他主体的尽职调查时，我们会把您的信息提供给必要的主体，但我们会通过和这些主体签署保密协议等方式要求其对您的个人信息采取合理的保密措施。
9、为了便于您与您的好友进行更加灵活、安全的资金往来，避免因手动输入尚吉通信登录名错误而产生损失，当您的尚吉通信账户所关联的手机号码被保存在他人手机通讯录中时，您的尚吉通信登录名、姓名等可以被通讯录存有该手机号码的好友查询到。本协议中所称的“尚吉通信账户关联的手机号码”，是指作为尚吉通信登录名的手机号码或尚吉通信账户绑定的手机号码。
10、同本部分第9项之目的，他人可以通过您尚吉通信账户关联手机号码查询到对应的尚吉通信登录名、您的姓名。
11、您与他人通过尚吉通信服务发生资金往来的，交易相对方可在付款过程中，或付款成功后可查看到您使用的尚吉通信账户的部分信息（包括尚吉通信登录名、尚吉通信账户对应的姓名或昵称、尚吉通信账户头像等，具体以实际可查看信息为准）。
12、如您授权第三方向尚吉通信查询、采集您尚吉通信账户相关信息，我们有权在法律法规和您的授权许可范围内向第三方分享您尚吉通信账户的部分信息。
13、为了维护和改善我们的服务。
14、根据法律法规的规定或有权机关的要求。</p>
                    <p class="subtitle">三、用户义务及免责声明</p>
                    <p>（一）您保证，您所提供的个人信息均为您本人的真实信息，不可为他人的信息或虚假信息，若涉嫌恶意信息作假或盗用他人信息，将可能记入网络征信系统，影响您的征信记录，同时本公司将保留追究您相应法律责任的权利。
（二）如您所提供的个人信息中的全部或部分信息为他人信息或虚假信息，本公司将有权暂停或终止与您的全部或部分服务协议，由此行为所产生的全部法律责任将由您承担，本公司将不对此承担法律责任。</p>
                </div>
            </div>
        </x-dialog>
        <x-dialog class="xdfuyin" v-model="makefushow" :hide-on-blur="true">
            <div class="xdcontainer">
                <div class="xdcontent">
                    <p class="title">服务协议</p>
                    <p style="text-indent: 0px;">委托方：（资金需求方，以下简称“甲方”）：</p>
                    <p style="text-indent: 0px;">受托方：（居间服务方，以下简称“乙方”）:</p>
                    <p>鉴于：</p>
                    <p>甲方因个人资金需求，特委托乙方为甲方制定融资方案（包含但不限于办理信用卡等形式），甲方积极配合乙方选择的，符合甲方意愿的资金方进行融资.</p>
                    <p>现乙方接受甲方委托，经协商，甲乙双方（以下简称“双方”）就下列问题取得一致，协议如下：</p>
                    <p class="subtitle">一、服务内容</p>
                    <p>1、办理次数：1-50次平台申请</p>
                    <p>2、资金利息：以甲方和资金方的约定为准。</p>
                    <p>3、甲方保证其提供的所有资料及信息真实及合法。如有虚假，甲方自行向资金方承担法律责任，乙方不承担任何保证责任。同时在办理期间，甲方要积极配合乙方的工作，乙方会协助甲方根据甲方自身条件推荐出与乙方有深度战略合作的额度高，放款快的特殊渠道（以申请为准），如申请次数内未下款，则在办理次数过后，乙方会退还前期199元咨询服务费。</p>
                    <p>4、合同签订后，如乙方发现甲方征信及还款纪录存在不良情况或黑名单等情形，则乙方有权暂时停止委托事项的办理，并通知甲方。甲方应在收到通知的3日内回复解决方案，否则，乙方有权终止本合同，且不退还已支付服务费。</p>
                    <p>5、甲方保证遵守履约承诺，本次委托为其本人意志体现。</p>
                    <p class="subtitle">二、争议解决条款</p>
                    <p>1、未尽事宜，双方应友好协商解决，协商不成的，任一方均应提请当地仲裁委员会按简易程序仲裁解决。</p>
                    <p>2、如发生诉讼或仲裁等情况的，甲方自愿承担乙方因其违约所产生的一切损失（包括但不限于催收费、诉讼费、仲裁费、律师费等相关费用）。</p>
                    <p>3、各方收件地址以其营业执照或身份证上记载的为准。如甲方拒收或因其他原因不能获得甲方签收的，则在投递之日起5日后视为送达。</p>
                    <p class="subtitle">三、合同的终止</p>
                    <p>本合同自发生以下任一情形时终止：</p>
                    <p>（1）本合同约定的委托事项完成，且甲方付清服务费等相关费用；</p>
                    <p>（2）经双方协商一致提前终止本协议；</p>
                    <p>（3）一方根据本协议的约定解除本协议。</p>
                    <p class="subtitle">四、其他</p>
                    <p>1、本合同自甲方回复“同意”之日起立即生效。</p>
                    <p>2、本协议为电子合约，双方下载保存并经确认后具同等法律效力。
（以下无正文）</p>
                </div>
            </div>
        </x-dialog>
    </div>
</template>
<script>
import { XInput,Group,XDialog  } from 'vux'

export default {
    name:"pregister",
    components:{
        XInput,
        Group,
        XDialog 
    },
    data(){
        return{
            username:"",
            phone:"",
            yzm:"",
            // psd:"",
            yqm:"",
            fuyinshow:false,
            makefuyinshow:false,
            fushow:false,
            makefushow:false,
            psdnum:"",
        }
    },
    methods:{
        // getpsd(val){
        //     let valen=val.length;
        //     let onm="";
        //     for(let i=0;i<valen;i++){
        //         onm=onm+"*";
        //     }
        //     this.psdnum=onm;
        //     this.psd=val;
        //     console.log(this.psd)
        // },
        fuyin(){//确认协议上
            if(this.$refs.fuyin.checked){
                this.fuyinshow=true;
            }else{
                this.fuyinshow=false;
            }
        },
        makefuyinshowfz(){
            if(this.makefuyinshow==false){
                this.makefuyinshow=true;
            }
        },
        fu(){//确认协议下
            if(this.$refs.fu.checked){
                this.fushow=true;
            }else{
                this.fushow=false;
            }
        },
        makefushowfz(){
            if(this.makefushow==false){
                this.makefushow=true;
            }
        },
        getyz(){//点击获取验证码
            console.log(555)
            this.action({
                moduleName:"getcode",
                url:'/member/getcode',
                method:'post',
                isFormData:true,
                data:{
                    phone:this.phone
                }
            }).then(res=>{
                if(res.code==200){
                    this.$vux.toast.text(res.message);
                }else{
                    this.$vux.toast.text(res.message);
                }
            }).catch(err=>{})
        },
        gologin(){
            this.$router.push("/Login")
        },
        // kk(){
        //     this.action({
        //         moduleName:"createOrder",
        //         url:'/pay/createOrder',
        //         method:'post',
        //         isFormData:true,
        //         data:{
        //             token:"a50e3ba6c7325378cee9e46d59347786",
        //             type:"3"
        //         }
        //     }).then(res=>{
        //         console.log(res)
        //     }).catch(err=>{})
        // },
        checksub(){//点击提交
            console.log(777);
            let telzz= /(^1[3|4|5|7|8]\d{9}$)|(^09\d{8}$)/;
            let pwdzz = /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,16}$/;//8到16位数字与字母组合
            if(this.phone==""){
                this.$vux.toast.text("请输入手机号码")
                return;
            }
            if (!telzz.test(this.phone)){
                this.$vux.toast.text("请输入有效的手机号码！")
                return;
            }
            if(this.yzm==""){
                this.$vux.toast.text("请输入验证码")
                return;
            }
            if(this.psdnum==""){
                this.$vux.toast.text("请输入密码")
                return;
            }
            if (!pwdzz.test(this.psdnum)){
                this.$vux.toast.text("请输入8到16位数字与字母的密码！")
                return;
            }
            if(this.yqm==""){
                this.$vux.toast.text("请输入邀请码")
                return;
            }
            if(!this.fuyinshow){
                 this.$vux.toast.text("请同意《服务与隐私协议》")
                return;
            }
            if(!this.fushow){
                 this.$vux.toast.text("请同意《服务协议》")
                return;
            }
            //获取token
            let hashobj={};
            try{
                let urlhash=window.location.href.split("?");
                let hashlist=urlhash[1].split("&");

                for(let i=0;i<hashlist.length;i++){
                    let iarr = hashlist[i].split("=");
                    hashobj[iarr[0]] =iarr[1];
                }
                console.log(hashobj)
            }catch(e){}
            let datafuyinshow;
            let datafushow;
            if(this.fuyinshow){
                datafuyinshow="1";
            }else{
                datafuyinshow="0";
            }
            if(this.fushow){
                datafushow="1";
            }else{
                datafushow="0";
            }
            this.action({
                moduleName:"WeChatRegister",
                url:'/member/WeChatRegister',
                method:'post',
                isFormData:true,
                data:{
                    // token:hashobj.token,
                    phone:this.phone,
                    password:this.psdnum,
                    referee:this.yqm,
                    code:this.yzm,
                    privacy:datafuyinshow,
                    service:datafushow
                }
            }).then(res=>{
                if(res.code==200){
                    this.action({
                        moduleName:'Logintelstart',
                        goods:{
                            token:hashobj.token,
                            phone:this.phone,
                             password:this.psdnum,
                            referee:this.yqm,
                            code:this.yzm,
                            privacy:datafuyinshow,
                            service:datafushow
                        }
                    })
                    this.$vux.toast.text(res.message);
                    setTimeout(() => {
                        this.$router.push("/Login");
                    }, 2000);
                    
                    // this.action({
                    //     moduleName:"createOrder",
                    //     url:'/pay/createOrder',
                    //     method:'post',
                    //     isFormData:true,
                    //     data:{
                    //         token:this.airforce.login_post.data.token,
                    //         type:"1"
                    //     }
                    // }).then(result=>{
                    //     if(result.code==200){
                    //         console.log(369852)
                    //         window.location.href=result.data.url;
                    //     }else{
                    //         this.$vux.toast.text(result.message);
                    //     }
                    // }).catch(error=>{})
                }else{
                    this.$vux.toast.text(res.message)
                }
            }).catch(err=>{})
            //this.$router.push("/Recharge")
        }
    },
    mounted(){

        
    }
}
</script>
<style lang="less" scoped>
.Pregister{
    position: absolute;
    width: 100%;
    height: 100%;
    background: #fff;
    padding-bottom: 100px;
    .title{
        font-size: 30px;
        color:#ff6633;
        line-height: 120px;
        padding-left: 40px;
    }
    .inputbox{
        border-bottom: 1px solid #dcdcdc;
        margin-left: 25px;
        margin-right: 25px;
        position: relative;
        &/deep/ .weui-cells:before{
            border: none;
        }
        &/deep/ .vux-no-group-title{
            label{
                img{
                    width: 18px;
                    height: 18px;
                    display: block;
                    float: left;
                    margin-top: 19px;
                }
                .sureread{
                    color: #aab2bd;
                    line-height: 56px;
                    padding-left: 5px;
                    a{
                        color:#ff6633;
                    }
                }
                input[type=checkbox]{
                    display: none;
                }
            }
        }
        .xinput{
            padding: 15px 0;
            img{
                width: 20px;
                height: 20px;
                display: block;
                margin-right: 5px;
            }
            
        }
        .getyz{
                line-height: 56px;
                position: absolute;
                right: 0;
                top: 0;
                color: #aab2bd;
                span{
                    color: #ff6633;
                }
            }  
    }
    .titlelist{
        margin: 10px 25px 20px;
        overflow: hidden;
        .smltitle{
            float:right;
            color: #ff6633;
            font-size: 14px;
        }
    }
    .submit{
        width: 90%;
        margin: 0 auto;
        height: 45px;
        line-height: 45px;
        border-radius: 23px;
        text-align: center;
        color: #fff;
        font-size: 18px;
        background:linear-gradient(to left,#f4a223 ,#f46a21);
        margin-top: 60px;
    }
    .xdfuyin{
        &/deep/ .xdcontainer{
            width: 100%;
            height: 500px;
            display: flex;
            flex-direction: column;
            .xdcontent{
                width: 100%;
                height: 100%;
                box-sizing: border-box;
                padding: 20px 13px;
                overflow: auto;
                flex: 1;
                p{
                    padding: 0;
                    line-height: 20px;
                    font-size: 14px;
                    text-align: left;
                    text-indent: 28px;
                }
                .subtitle{
                    font-size: 14px;
                    text-indent: 0px;
                    line-height: 30px;
                    font-weight: 600;
                }
                .title{
                    text-indent: 0px;
                    font-size: 18px;
                    color: #ff6633;
                    text-align: center;
                    line-height: 60px;
                }
            }
        }
    }
}
</style>
